app/Controllers/PaqueteController.php

SELECT *
FROM `paquetes`
---
    public function index() {
        $paquetes = $this->paqueteModel->findAll();

SELECT *
FROM `paquetes`
WHERE `paquetes`.`id` = '10'
---
    public function show($id) {
        $paquete = $this->paqueteModel->find($id);

INSERT INTO `paquetes` (`nombre`, `descripcion`, `cantidad_fotos`, `precio`, `imagen`, `usuario_id`) VALUES ('Paqueton de oferta', 'super paquete economico con una camara y nomas ', '10', '5000', 'paqueton_economico.jpg', '107')
---
    public function store() {
        $data = array(
            'nombre' => $this->request->getPost('nombre'),
            'descripcion' => $this->request->getPost('descripcion'),
            'cantidad_fotos' => $this->request->getPost('cantidad_fotos'),
            'precio' => $this->request->getPost('precio'),
            'imagen' => $this->request->getPost('imagen'),
            'usuario_id' => $this->request->getPost('usuario_id')
        );

        $this->paqueteModel->save($data);

SELECT *
FROM `paquetes`
WHERE `paquetes`.`id` = '1'
---
    public function edit($id) {
        $paquete = $this->paqueteModel->find($id);